content/blog/pelicanBloggingWithOrgMode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-11 za 10:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="SpeDAllen" />
<meta name="generator" content="Org Mode" />
<title>Pelican blogging with Org mode</title>
<meta name="date" content="2024-04-27 14:59" />
<meta name="SLUG" content="pelican-blogging-with-org-mode" />
<meta name="keywords" content="flakes, blog, pelican, devShell, orgMode, gitHub" />
<meta name="language" content="en" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-orgdb95524" class="outline-3">
<h3 id="orgdb95524">GitHub pages</h3>
<div class="outline-text-3" id="text-orgdb95524">
<p>
GitHub will host your static web pages for you even on a free account making it rather ideal for a blog hosting platform.
</p>
</div>
</div>
<div id="outline-container-org45c69e1" class="outline-3">
<h3 id="org45c69e1">Pelican</h3>
<div class="outline-text-3" id="text-org45c69e1">
<p>
But before setting anything up in GitHub you should decide on your tooling. There are several site generators freely available with <a href="https://jekyllrb.com/">Jenkyll</a> probably being the most popular. I initially was going to use <a href="https://jekyllrb.com/">Jenkyll</a> but after noticing it's license I decided to look for alternatives. <a href="https://www.sitepoint.com/6-static-blog-generators-arent-jekyll/">Using this article</a> I found Pelican which is licensed with AGPL which I feel offers more protection from open source exploitation. 
</p>
</div>
</div>
<div id="outline-container-org92f1f8b" class="outline-3">
<h3 id="org92f1f8b">Git started</h3>
<div class="outline-text-3" id="text-org92f1f8b">
<p>
With my tooling and hosting platform decided upon I followed this <a href="https://fedoramagazine.org/make-github-pages-blog-with-pelican/">Fedoria magazine article</a> to setup the basic Git structure. I use NixOs so not every applies to me but it was very helpful. They casually mention initializing your source repository with a readme but I found out the hard way that it's better to initialize it with a python .gitignore file.
</p>
</div>
</div>
<div id="outline-container-org0566b33" class="outline-3">
<h3 id="org0566b33">Dev environment</h3>
<div class="outline-text-3" id="text-org0566b33">
<p>
With a place to store and track my progress setup it was time to install the tools. I started with setting up a flake that I could use to version control the software used. It's not complicated if your accustomed to flakes.
</p>
<div class="org-src-container">
<pre class="src src-nix">
<span style="color: #c792ea;">{</span>
  <span style="color: #ffcb6b;">description</span> = <span style="color: #c3e88d;">"blog"</span>;
  <span style="color: #ffcb6b;">inputs</span> =
    <span style="color: #f78c6c;">{</span>
      <span style="color: #ffcb6b;">nixpkgs.url</span> = <span style="color: #c3e88d;">"github:nixos/nixpkgs/23.11"</span>;
     <span style="color: #f78c6c;">}</span>;
  <span style="color: #ffcb6b;">outputs</span> = <span style="color: #f78c6c;">{</span> self, nixpkgs <span style="color: #f78c6c;">}</span>:
    <span style="color: #89DDFF;">let</span>
      <span style="color: #ffcb6b;">system</span> = <span style="color: #c3e88d;">"x86_64-linux"</span>;
      <span style="color: #ffcb6b;">pkgs</span> = nixpkgs.legacyPackages.$<span style="color: #f78c6c;">{</span>system<span style="color: #f78c6c;">}</span>;
    <span style="color: #89DDFF;">in</span>
    <span style="color: #f78c6c;">{</span>
      <span style="color: #ffcb6b;">devShells.x86_64-linux.default</span> = <span style="color: #c3e88d;">(</span> <span style="color: #82aaff;">import</span> <span style="color: #f78c6c;">./shell.nix</span> <span style="color: #89DDFF;">{</span> <span style="color: #89DDFF;">inherit</span> pkgs; <span style="color: #89DDFF;">}</span><span style="color: #c3e88d;">)</span>;
    <span style="color: #f78c6c;">}</span>;
<span style="color: #c792ea;">}</span>
</pre>
</div>
<p>
Basically you specify your sources and where you want to use them and Nix takes care of the rest. The Nix shell was surprisingly simple after a lot of trial and error due to my inexperience using them this way.
</p>
<div class="org-src-container">
<pre class="src src-nix">
<span style="color: #c792ea;">{</span> pkgs ? <span style="color: #82aaff;">import</span> <span style="color: #f78c6c;">&lt;nixpkgs&gt;</span> <span style="color: #f78c6c;">{</span> <span style="color: #f78c6c;">}</span> <span style="color: #c792ea;">}</span>:
pkgs.mkShell
  <span style="color: #c792ea;">{</span>
    <span style="color: #ffcb6b;">packages</span> = <span style="color: #f78c6c;">[</span>
      <span style="color: #c3e88d;">(</span>pkgs.python3.withPackages <span style="color: #89DDFF;">(</span>python-pkgs: <span style="color: #bb80b3;">[</span>
        python-pkgs.pelican
        python-pkgs.ghp-import
      <span style="color: #bb80b3;">]</span><span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span>
      pkgs.emacs
      pkgs.emacsPackages.htmlize
      pkgs.emacsPackages.nix-mode
    <span style="color: #f78c6c;">]</span>;
  <span style="color: #c792ea;">}</span>
</pre>
</div>
<p>
The emacs packages used here aren't necessary if you don't plan to use the org_reader Pelican plugin. If you want to write your blog using markdown or something else it can be safely omitted. Now to work on a blog post I only need to navigate to the source git repo in the command line and run.
</p>
<div class="org-src-container">
<pre class="src src-shell">
nix develop
make devserver
</pre>
</div>
<p>
That will process the source files and serve the sight at <a href="http://127.0.0.1:8000">http://127.0.0.1:8000</a> while monitoring your sources for changes so you can view your blog as you work on it. Since it's a nix shell I need only exit for the tooling to be removed. And because it's in a flake it will be rebuilt identically the next time.
</p>
</div>
</div>
<div id="outline-container-org964bddc" class="outline-3">
<h3 id="org964bddc">Org mode blogging with Pelican</h3>
<div class="outline-text-3" id="text-org964bddc">
<p>
Out of the box Pelican doesn't support org documents as source but there are three plugins you can use.
</p>
</div>
<div id="outline-container-org33f0bff" class="outline-4">
<h4 id="org33f0bff">org_pandoc_reader</h4>
<div class="outline-text-4" id="text-org33f0bff">
<p>
It appears to be very simple to use but it sadly hasn't been maintained. Requiring a very old version of python that's no longer available in the Nix packages.
</p>
</div>
</div>
<div id="outline-container-orgfbd1b72" class="outline-4">
<h4 id="orgfbd1b72">org_python_reader</h4>
<div class="outline-text-4" id="text-orgfbd1b72">
<p>
Is newer but sadly one of it's dependencies pyton-orgco isn't packaged by nix yet.
</p>
</div>
</div>
<div id="outline-container-orgcdb1302" class="outline-4">
<h4 id="orgcdb1302">org_reader</h4>
<div class="outline-text-4" id="text-orgcdb1302">
<p>
Is the most logical of the org plugins available requiring only emacs which you're probably using to author your org documents anyway. It needs to know the path to emacs which is complicated by running nix shell on NixOS.
</p>
</div>
</div>
</div>
<div id="outline-container-org2f2ba09" class="outline-3">
<h3 id="org2f2ba09">Installing and configuring org_reader</h3>
<div class="outline-text-3" id="text-org2f2ba09">
<p>
I chose to add the pelican plugins repo as a git submodule to keep everything contained and make my paths simple. It's may not be the best solution but since I already have a submodule for the output why not add more? Per the plugins documentation I only needed to tell Pelican where to find the plugins and define what to use.
</p>
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #ffcb6b;">PLUGIN_PATHS</span> = <span style="color: #c792ea;">[</span><span style="color: #c3e88d;">'./pelican-plugins'</span><span style="color: #c792ea;">]</span>
<span style="color: #ffcb6b;">PLUGINS</span> = <span style="color: #c792ea;">[</span><span style="color: #c3e88d;">'org_reader'</span><span style="color: #c792ea;">]</span>
</pre>
</div>
<p>
Telling org_reader where to find emacs in a nix shell dev environment was a bit more tricky. I settled on making the shell that installs emacs do it for me. Someday I may improve this bash with some simple if statements but it's enough to keep me moving forward. The property doesn't need to be added every time nix develop is called so once it did it's thing I commented it out leaving my shell.nix file looking like
</p>
<div class="org-src-container">
<pre class="src src-nix">
  <span style="color: #c792ea;">{</span> pkgs ? <span style="color: #82aaff;">import</span> <span style="color: #f78c6c;">&lt;nixpkgs&gt;</span> <span style="color: #f78c6c;">{</span> <span style="color: #f78c6c;">}</span> <span style="color: #c792ea;">}</span>:
pkgs.mkShell
  <span style="color: #c792ea;">{</span>
    <span style="color: #ffcb6b;">packages</span> = <span style="color: #f78c6c;">[</span>
      <span style="color: #c3e88d;">(</span>pkgs.python3.withPackages <span style="color: #89DDFF;">(</span>python-pkgs: <span style="color: #bb80b3;">[</span>
        python-pkgs.pelican
        python-pkgs.ghp-import
      <span style="color: #bb80b3;">]</span><span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span>
      pkgs.emacs
      pkgs.emacsPackages.htmlize
      pkgs.emacsPackages.nix-mode
    <span style="color: #f78c6c;">]</span>;
    <span style="color: #676E95;"># shellHook = ''</span>
    <span style="color: #676E95;">#   echo ORG_READER_EMACS_LOCATION = \'${pkgs.emacs}/bin/emacs\' &gt;&gt; ./pelicanconf.py</span>
    <span style="color: #676E95;"># '';</span>
  <span style="color: #c792ea;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5ee1a67" class="outline-2">
<h2 id="org5ee1a67">Final thoughts</h2>
<div class="outline-text-2" id="text-org5ee1a67">
<p>
There's work still to be done with the syntax highlighting some formatting I'd like to improve but that can be tomorrows problem.
</p>
</div>
</div>
</div>
</body>
</html>
